[
    {
        "heading": "Overview",
        "main_para": "Start your business journey effortlessly with our streamlined Sole Proprietorship Firm Registration service. Tailored for entrepreneurs and sole owners, this process ensures complete compliance with registration process and operational control from the get-go."
    },
    {
        "heading": "Documents Required for Registering a Proprietorship Firm",
        "main_para": "Collect the essential documents:\nAadhar Card and PAN Card of the proprietor\nOwner's Photograph (JPEG format, max. size – 100 KB)Bank account details\nFor the bank account, upload a cancelled cheque or passbook/bank statement (JPEG/PDF format, max. size – 100 KB).\nAddress Proof Options:\nProperty tax receipt Municipal Khata copy\nElectricity bill copy\nOwnership deed/document (for owned property)\nLease/rent agreement (for leased/rented property) – Attach with (a), (b), or (c)\nConsent letter / NOC from the owner (for a shared property) – Attach with (a), (b), or (c)   "
    },
    {
        "heading": "Benefits of Sole Proprietorship Firm Registration",
        "main_para": [
            ["Merits of Sole Proprietorship", "Demerits of Sole Proprietorship"],
            ["Easy to form and operate", "Unlimited personal liability"],
            ["Complete control and decision-making power with the owner", "Limited ability to raise capital"],
            ["Tax benefits as profits are taxed as personal income of the owner", "Limited growth potential"],
            ["Flexibility to make changes in the business quickly", "Difficulty in attracting and retaining talented employees"],
            ["Minimal regulatory compliance requirements", "Limited ability to transfer ownership or sell the business"]
        ]
    },
    {
        "heading": "Compliance for Sole Proprietorship Firm Registration",
        "main_para": "Navigate compliance seamlessly with expert guidance:\nGST Return Filing: Timely GST return submissions to stay compliant.\nAccurate Accounting: Precise Balance Sheets and Profit and Loss Statements Preparation.\nEffortless Income Tax Filing: Smooth filing of business and personal returns.\nTDS Return Filing (if applicable): Confidently meet TDS requirements."
    },
    {
        "heading": "Comparative Insights",
        "main_para": [
            ["Aspects", "Sole Proprietorship", "One Person Company"],
            ["Legal Status", "Not a separate legal entity. The business and the owner are considered the same entity.", "A separate legal entity. The business has a distinct identity from the owner."],
            ["Compliance", "Minimal compliance requirements include obtaining business licenses and filing income tax returns.", "A higher degree of compliance is required, such as maintaining proper books of accounts and filing annual returns with the Registrar of Companies."],
            ["Ownership","The business is owned and operated by a single individual.","The business is owned and operated by a single individual, who acts as both the director and shareholder of the company."
              ],
              ["Taxation","The owner is taxed as an individual on the profits earned by the business.","The company is taxed as a separate legal entity, and the owner is taxed on any dividends received from the company."],
              [
                "Capital","The owner contributes all the capital required for the business.",
                "The owner can raise capital by issuing shares or taking loans in the name of the company."
              ],
              [
                "Continuity",
                "The business ceases to exist upon the death of the owner.",
                "The business continues to exist even after the death of the owner and can be passed on to their legal heirs."
              ]
        ]
    }
]



