[
    {
        "heading": "Overview",
        "main_para": "Start your business journey effortlessly with our streamlined Sole Proprietorship Firm Registration service. Tailored for entrepreneurs and sole owners, this process ensures complete compliance with registration process and operational control from the get-go."
    },
    {
        "heading": "Documents Required for Registering a Proprietorship Firm",
        "main_para": "Collect the essential documents:\nAadhar Card and PAN Card of the proprietor\nOwner's Photograph (JPEG format, max. size – 100 KB)Bank account details\nFor the bank account, upload a cancelled cheque or passbook/bank statement (JPEG/PDF format, max. size – 100 KB).\nAddress Proof Options:\nProperty tax receipt Municipal Khata copy\nElectricity bill copy\nOwnership deed/document (for owned property)\nLease/rent agreement (for leased/rented property) – Attach with (a), (b), or (c)\nConsent letter / NOC from the owner (for a shared property) – Attach with (a), (b), or (c)   "
    },
    {
        "heading": "Benefits of Sole Proprietorship Firm Registration",
        "main_para": [
            ["Merits of Sole Proprietorship", "Demerits of Sole Proprietorship"],
            ["Easy to form and operate", "Unlimited personal liability"],
            ["Complete control and decision-making power with the owner", "Limited ability to raise capital"],
            ["Tax benefits as profits are taxed as personal income of the owner", "Limited growth potential"],
            ["Flexibility to make changes in the business quickly", "Difficulty in attracting and retaining talented employees"],
            ["Minimal regulatory compliance requirements", "Limited ability to transfer ownership or sell the business"]
        ]
    },
    {
        "heading": "Compliance for Sole Proprietorship Firm Registration",
        "main_para": "Navigate compliance seamlessly with expert guidance:\nGST Return Filing: Timely GST return submissions to stay compliant.\nAccurate Accounting: Precise Balance Sheets and Profit and Loss Statements Preparation.\nEffortless Income Tax Filing: Smooth filing of business and personal returns.\nTDS Return Filing (if applicable): Confidently meet TDS requirements."
    },
    {
        "heading": "Comparative Insights",
        "main_para": "table"
    }
]



